app/controllers/users_controller.rb

SELECT * FROM "users"
SELECT count(*) AS count_all FROM "users"
---
  def index
    @users = User.all
    @count = User.count

INSERT INTO "users" ("name", "created_at", "updated_at", "age") VALUES('Oren Teich', '2010-05-18 01:47:20', '2010-05-18 01:47:20', 34)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

DELETE FROM "users" WHERE "id" = 1
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy